Model: "a2c"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 24)]         0                                            
__________________________________________________________________________________________________
Policy_mu_2 (Dense)             (None, 48)           1200        input_1[0][0]                    
__________________________________________________________________________________________________
Policy_sigma_2 (Dense)          (None, 48)           1200        input_1[0][0]                    
__________________________________________________________________________________________________
Value_layer_2 (Dense)           (None, 48)           1200        input_1[0][0]                    
__________________________________________________________________________________________________
Policy_mu_readout (Dense)       (None, 4)            196         Policy_mu_2[0][0]                
__________________________________________________________________________________________________
Policy_sigma_readout (Dense)    (None, 4)            196         Policy_sigma_2[0][0]             
__________________________________________________________________________________________________
Value_readout (Dense)           (None, 1)            49          Value_layer_2[0][0]              
__________________________________________________________________________________________________
lambda (Lambda)                 {'mu': None, 'sigma' 0           Policy_mu_readout[0][0]          
                                                                 Policy_sigma_readout[0][0]       
                                                                 Value_readout[0][0]              
==================================================================================================
Total params: 4,041
Trainable params: 4,041
Non-trainable params: 0
__________________________________________________________________________________________________
