Model: "a2c"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 24)]         0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 48)           1200        input_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 48)           1200        input_1[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 48)           1200        input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 48)           2352        dense[0][0]                      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 48)           2352        dense_3[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 48)           2352        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 48)           2352        dense_1[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 48)           2352        dense_4[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 48)           2352        dense_7[0][0]                    
__________________________________________________________________________________________________
Policy_mu_readout (Dense)       (None, 8)            392         dense_2[0][0]                    
__________________________________________________________________________________________________
Policy_sigma_readout (Dense)    (None, 8)            392         dense_5[0][0]                    
__________________________________________________________________________________________________
Value_readout (Dense)           (None, 1)            49          dense_8[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 {'mu': None, 'sigma' 0           Policy_mu_readout[0][0]          
                                                                 Policy_sigma_readout[0][0]       
                                                                 Value_readout[0][0]              
==================================================================================================
Total params: 18,545
Trainable params: 18,545
Non-trainable params: 0
__________________________________________________________________________________________________
