Model: "target_network"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 24)]              0         
_________________________________________________________________
dense (Dense)                (None, 8)                 200       
_________________________________________________________________
dense_1 (Dense)              (None, 8)                 72        
_________________________________________________________________
output (Dense)               (None, 8)                 72        
=================================================================
Total params: 344
Trainable params: 344
Non-trainable params: 0
_________________________________________________________________
